# ActiveDocument Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CommandEventArgs..::..ActiveDocument Property
CommandEventArgs Class See Also
---
The active document.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Document ActiveDocument { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActiveDocument As Document
	Get
```

Visual C++
---
```text
public:
property Document^ ActiveDocument {
	Document^ get ();
}
```

# See Also
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace